src/main/java/ok/dht/test/scheredin/report/stage_2/wrk_output_multi_thread_LIFO
wrk2 -R 600 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/get.lua  -L http://localhost:19234 && sleep 20 && wrk2 -R 40500 -c 32 -t 4 -d 60s -s /Users/artem.scheredin/projects/technop/highload/src/main/java/ok/dht/test/scheredin/report/scripts/put.lua  -L http://localhost:19234

Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 2.419ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.427ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.596ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.335ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.83ms    2.70ms  17.20ms   94.78%
    Req/Sec   158.70     87.08   500.00     77.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.60ms
 90.000%    2.08ms
 99.000%   14.00ms
 99.900%   15.98ms
 99.990%   16.82ms
 99.999%   17.22ms
100.000%   17.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.136     0.000000            1         1.00
       0.586     0.100000         3007         1.11
       0.783     0.200000         5997         1.25
       0.946     0.300000         9007         1.43
       1.084     0.400000        11992         1.67
       1.213     0.500000        15001         2.00
       1.278     0.550000        16496         2.22
       1.347     0.600000        18011         2.50
       1.422     0.650000        19482         2.86
       1.507     0.700000        20989         3.33
       1.601     0.750000        22488         4.00
       1.654     0.775000        23230         4.44
       1.715     0.800000        23978         5.00
       1.782     0.825000        24735         5.71
       1.862     0.850000        25480         6.67
       1.953     0.875000        26230         8.00
       2.010     0.887500        26602         8.89
       2.077     0.900000        26984        10.00
       2.169     0.912500        27354        11.43
       2.285     0.925000        27729        13.33
       2.481     0.937500        28101        16.00
       2.695     0.943750        28288        17.78
      11.311     0.950000        28474        20.00
      12.039     0.956250        28661        22.86
      12.423     0.962500        28859        26.67
      12.727     0.968750        29040        32.00
      12.855     0.971875        29133        35.56
      13.023     0.975000        29226        40.00
      13.167     0.978125        29318        45.71
      13.335     0.981250        29411        53.33
      13.527     0.984375        29504        64.00
      13.623     0.985938        29551        71.11
      13.767     0.987500        29600        80.00
      13.911     0.989062        29648        91.43
      14.079     0.990625        29692       106.67
      14.271     0.992188        29739       128.00
      14.367     0.992969        29763       142.22
      14.479     0.993750        29787       160.00
      14.631     0.994531        29809       182.86
      14.847     0.995313        29833       213.33
      15.023     0.996094        29855       256.00
      15.103     0.996484        29867       284.44
      15.183     0.996875        29879       320.00
      15.263     0.997266        29891       365.71
      15.367     0.997656        29902       426.67
      15.511     0.998047        29917       512.00
      15.543     0.998242        29920       568.89
      15.631     0.998437        29926       640.00
      15.775     0.998633        29932       731.43
      15.903     0.998828        29937       853.33
      15.991     0.999023        29943      1024.00
      16.047     0.999121        29946      1137.78
      16.087     0.999219        29949      1280.00
      16.119     0.999316        29952      1462.86
      16.215     0.999414        29955      1706.67
      16.343     0.999512        29959      2048.00
      16.343     0.999561        29959      2275.56
      16.431     0.999609        29961      2560.00
      16.495     0.999658        29962      2925.71
      16.511     0.999707        29964      3413.33
      16.559     0.999756        29965      4096.00
      16.735     0.999780        29967      4551.11
      16.735     0.999805        29967      5120.00
      16.735     0.999829        29967      5851.43
      16.767     0.999854        29968      6826.67
      16.815     0.999878        29969      8192.00
      16.815     0.999890        29969      9102.22
      16.847     0.999902        29970     10240.00
      16.847     0.999915        29970     11702.86
      16.847     0.999927        29970     13653.33
      16.895     0.999939        29971     16384.00
      16.895     0.999945        29971     18204.44
      16.895     0.999951        29971     20480.00
      16.895     0.999957        29971     23405.71
      16.895     0.999963        29971     27306.67
      17.215     0.999969        29972     32768.00
      17.215     1.000000        29972          inf
#[Mean    =        1.829, StdDeviation   =        2.700]
#[Max     =       17.200, Total count    =        29972]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36004 requests in 1.00m, 2.26MB read
Requests/sec:    600.05
Transfer/sec:     38.55KB
Running 1m test @ http://localhost:19234
  4 threads and 32 connections
  Thread calibration: mean lat.: 1.260ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.259ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.261ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  638.79us  14.66ms   71.43%
    Req/Sec    10.68k   821.18    15.67k    70.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.62ms
 90.000%    2.01ms
 99.000%    2.73ms
 99.900%    6.22ms
 99.990%   11.89ms
 99.999%   13.93ms
100.000%   14.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.053     0.000000            1         1.00
       0.496     0.100000       203055         1.11
       0.712     0.200000       405474         1.25
       0.882     0.300000       607063         1.43
       1.038     0.400000       810440         1.67
       1.189     0.500000      1011782         2.00
       1.267     0.550000      1113994         2.22
       1.346     0.600000      1214056         2.50
       1.430     0.650000      1315614         2.86
       1.520     0.700000      1416472         3.33
       1.619     0.750000      1518317         4.00
       1.672     0.775000      1568500         4.44
       1.728     0.800000      1618883         5.00
       1.789     0.825000      1669747         5.71
       1.855     0.850000      1720272         6.67
       1.928     0.875000      1770600         8.00
       1.969     0.887500      1796355         8.89
       2.012     0.900000      1821196        10.00
       2.059     0.912500      1846738        11.43
       2.111     0.925000      1871840        13.33
       2.171     0.937500      1897409        16.00
       2.205     0.943750      1910160        17.78
       2.241     0.950000      1922323        20.00
       2.283     0.956250      1935237        22.86
       2.331     0.962500      1947940        26.67
       2.387     0.968750      1960530        32.00
       2.417     0.971875      1966459        35.56
       2.453     0.975000      1972774        40.00
       2.495     0.978125      1979355        45.71
       2.541     0.981250      1985515        53.33
       2.595     0.984375      1991788        64.00
       2.627     0.985938      1995023        71.11
       2.665     0.987500      1998167        80.00
       2.707     0.989062      2001336        91.43
       2.755     0.990625      2004431       106.67
       2.815     0.992188      2007595       128.00
       2.853     0.992969      2009168       142.22
       2.897     0.993750      2010735       160.00
       2.949     0.994531      2012305       182.86
       3.015     0.995313      2013866       213.33
       3.115     0.996094      2015463       256.00
       3.187     0.996484      2016248       284.44
       3.285     0.996875      2017032       320.00
       3.437     0.997266      2017818       365.71
       3.669     0.997656      2018608       426.67
       3.999     0.998047      2019401       512.00
       4.199     0.998242      2019793       568.89
       4.503     0.998437      2020188       640.00
       4.891     0.998633      2020584       731.43
       5.483     0.998828      2020978       853.33
       6.323     0.999023      2021374      1024.00
       6.675     0.999121      2021573      1137.78
       7.087     0.999219      2021770      1280.00
       7.555     0.999316      2021967      1462.86
       8.087     0.999414      2022164      1706.67
       8.695     0.999512      2022363      2048.00
       9.111     0.999561      2022460      2275.56
       9.503     0.999609      2022559      2560.00
       9.847     0.999658      2022658      2925.71
      10.271     0.999707      2022757      3413.33
      10.639     0.999756      2022856      4096.00
      10.855     0.999780      2022905      4551.11
      11.031     0.999805      2022954      5120.00
      11.247     0.999829      2023005      5851.43
      11.471     0.999854      2023054      6826.67
      11.647     0.999878      2023103      8192.00
      11.775     0.999890      2023127      9102.22
      11.911     0.999902      2023152     10240.00
      12.031     0.999915      2023179     11702.86
      12.135     0.999927      2023201     13653.33
      12.319     0.999939      2023228     16384.00
      12.351     0.999945      2023238     18204.44
      12.471     0.999951      2023251     20480.00
      12.623     0.999957      2023263     23405.71
      12.839     0.999963      2023275     27306.67
      13.135     0.999969      2023288     32768.00
      13.295     0.999973      2023294     36408.89
      13.471     0.999976      2023301     40960.00
      13.519     0.999979      2023306     46811.43
      13.631     0.999982      2023312     54613.33
      13.751     0.999985      2023320     65536.00
      13.775     0.999986      2023322     72817.78
      13.863     0.999988      2023325     81920.00
      13.903     0.999989      2023328     93622.86
      13.943     0.999991      2023331    109226.67
      14.031     0.999992      2023334    131072.00
      14.071     0.999993      2023336    145635.56
      14.095     0.999994      2023337    163840.00
      14.175     0.999995      2023339    187245.71
      14.215     0.999995      2023341    218453.33
      14.255     0.999996      2023342    262144.00
      14.263     0.999997      2023343    291271.11
      14.263     0.999997      2023343    327680.00
      14.407     0.999997      2023344    374491.43
      14.415     0.999998      2023345    436906.67
      14.471     0.999998      2023346    524288.00
      14.471     0.999998      2023346    582542.22
      14.471     0.999998      2023346    655360.00
      14.503     0.999999      2023347    748982.86
      14.503     0.999999      2023347    873813.33
      14.551     0.999999      2023348   1048576.00
      14.551     0.999999      2023348   1165084.44
      14.551     0.999999      2023348   1310720.00
      14.551     0.999999      2023348   1497965.71
      14.551     0.999999      2023348   1747626.67
      14.671     1.000000      2023349   2097152.00
      14.671     1.000000      2023349          inf
#[Mean    =        1.241, StdDeviation   =        0.639]
#[Max     =       14.664, Total count    =      2023349]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2429229 requests in 1.00m, 155.22MB read
Requests/sec:  40487.55
Transfer/sec:      2.59MB